{
  "en": {
    "title": "Work",
    "list": [
      {
        "code": "appliance",
        "title": "Raker Appliance Repair",
        "dates": "2021 - 2022",
        "description": "<p>This project allowed our customer to manage appliance repair requests. It has an admin and a technician level of access, as well as a webpage to register the repair requests.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1O91ziczzsstclD_KbJjn868VXtNw-mJd/preview' frameborder='0' allow='fullscreen'></iframe></div><p>The admin is able to check unassigned service requests on a sortable and filterable list, and assign them to a list of technicians.</p><p>The technician is able to check what service requests has assigned by date, and mark them as done once he's done with the job. He can also view all the assigned service requests in a map and get directions to arrive.</p>"
      },
      {
        "code": "buckedup",
        "title": "Bucked Up",
        "dates": "2020 - 2022",
        "description": "<p>Bucked Up is a leader in the supplement industry. I was in charge of a couple of projects for them:</p><p>- Migrate their ecommerce to a react application with multi-store support.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1U28yZU7rYxK4OoD-30lxvk9f7aBlJfnm/preview' frameborder='0' allow='fullscreen'></iframe></div><p>- Create their \"bootcamp\" web app with React. This is an workout challenge that allows their customer to follow a workout and meal plans, and upload photos of their progress. The challenge is changed every 6 weeks.</p><p>- Create their Ambassadors (affiliates) app. This is a multi platform mobile app -Android/iOS- developed with react native. Allowed their ambassadors to access and manage content to sell their products.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1T98K3yMz9TVKz2iTdFJ0662Jp1gejxDL/preview' frameborder='0' allow='fullscreen'></iframe></div>"
      },
      {
        "code": "stim",
        "title": "Stim social",
        "dates": "2015 - 2020",
        "description": "<p>It was a SAAS product for a company based on Salt Lake City, Utah.</p><p>I was the only frontend developer working on the project and that was my main role. The stack used was Grunt, Angular 1.6 and LESS.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1qXeyUnPR2TDt-iBaHpy9Xmj-IWvchguN/preview' frameborder='0' allow='fullscreen'></iframe></div><p>My work here consisted on making the UI of a dashboard with +26 unique views allowing customers to create their Stim accounts, add their social media accounts (instagram &amp; tiktok) and manage them through a series of targets, settings and several reports.</p><p>The design was already done when I joined, when a new component was requested, I had to stick to the visual scheme that was already done.</p><p>This web app is based on Opencart, and has Paypal, Braintree and Stripe integrations for payments.</p><p>After 2 years of working on this project, I was required to find a way to create a cloned version of the app so new partners could have their own branded version of it.<br />This was made using Grunt and Node: running a node command, the default theme would be cloned into a directory using the new brand name, with customization capability and getting new features and changes from the default theme as they were are added.</p>"
      },
      {
        "code": "biggame",
        "title": "Big Game",
        "dates": "2021 - 2022",
        "description": "<p>This is a clone of Bucked Up ambassadors app. They requested to have the exact same features with slightly different colors.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1TDs-63CcYtUgdVTSLE-XRvnyfN83-qLb/preview' frameborder='0' allow='fullscreen'></iframe></div>"
      },
      {
        "code": "muna",
        "title": "Muna",
        "dates": "2020",
        "description": "<p>This ecommerce website was made with Wordpress, I used a speed optimized theme (astra) as a base and customized to apply the design and integrate several marketing tools, such as Facebook shop, a facebook pixel, google ads and mailchimp.</p><p>Payments are made with Woocommerce and a local payment gateway. It allows credit cards, bank wires and \"cash\" (by printing a payment ticket). Shipment is automatically calculated using the APIs from two local couriers.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1Orzhq9FFopprTkwtze3t3vVce5l2M3bD/preview' frameborder='0' allow='fullscreen'></iframe></div>"
      },
      {
        "code": "agency",
        "title": "Agency Dashboard",
        "dates": "2018 - 2020",
        "description": "<p>This is a Wordpress plugin for marketing/advertising agencies to install in their website and get a reduced version of Stim dashboard.</p><p>I was the only developer working on the plugin, the frontend is made with Vue, LESS and Grunt, the backend connects to the Stim API and authorization is made with tokens.</p><div class='video-container portrait'><iframe src='https://drive.google.com/file/d/1yJqnh0bemk08tXA3ke_zSuXH6C-L5AO6/preview' frameborder='0' allow='fullscreen'></iframe></div>"
      }
    ]
  },
  "es": {
    "title": "Trabajos",
    "list": [
      {
        "code": "appliance",
        "title": "Raker Appliance Repair",
        "dates": "2021 - 2022",
        "description": "<p>Este proyecto le permitió al cliente gestionar peticiones para reparaciones de electrodomésticos. Tiene usuarios con acceso a nivel administrador y a nivel \"técnicos\", así como una aplicación web para solicitar las reparaciones.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1O91ziczzsstclD_KbJjn868VXtNw-mJd/preview' frameborder='0' allow='fullscreen'></iframe></div><p>El administrador puede chequear las peticiones sin asignar en una lista que se puede ordenar y filtrar para asignarlas a una lista de técnicos.</p><p>El técnico es capaz de ver qué peticiones le fueron asignadas por fecha y marcarlas como listas una vez que termina su trabajo. Los técnicos también pueden ver todas las peticiones de reparación que tienen asignadas en un mapa y obtener direcciones para llegar hasta el lugar.</p>"
      },
      {
        "code": "buckedup",
        "title": "Bucked Up",
        "dates": "2020 - 2022",
        "description": "<p>Bucked Up es un lider en la industria de suplementos. Estuve a cargo de varios proyectos para ellos:</p><p>- Migrar su ecommerce a una aplicación React con soporte para múltiples tiendas.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1U28yZU7rYxK4OoD-30lxvk9f7aBlJfnm/preview' frameborder='0' allow='fullscreen'></iframe></div><p>- Crear una applicación web \"bootcamp\" con React. Son desafíos de ejercicios que les permite a sus clientes seguir un plan de ejercicios y comidas, y subir fotos de su progreso. El desafío cambia cada 6 semanas.</p><p>- Crear su aplicación mobil de embajadores (afiliados). Esta es una aplicación mobil multi plataforma (Android and iOS) desarrollada en React Native. Les permite a sus embajadores acceder y gestionar contenido para vender sus productos.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1T98K3yMz9TVKz2iTdFJ0662Jp1gejxDL/preview' frameborder='0' allow='fullscreen'></iframe></div>"
      },
      {
        "code": "stim",
        "title": "Stim social",
        "dates": "2015 - 2020",
        "description": "<p>Fue un producto SASS para una compañía de Salt Lake City, Utah.</p><p>Yo era el único programador frontend trabajando en el proyecto y ese era mi rol principal allí. El stack que usamos fue Grunt, Angular 1.6 and LESS.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1qXeyUnPR2TDt-iBaHpy9Xmj-IWvchguN/preview' frameborder='0' allow='fullscreen'></iframe></div><p>Mi trabajo consistió en hacer la UI de un gestor de cuentas con más de 26 pantallas únicas que permitía a sus clientes crear sus cuentas Stim, agregar sus cuentas de redes sociales (instagram y tiktok) y gestionarlas a través de objetivos, configuraciones y varios reportes.</p><p>El diseño ya estaba hecho cuando me uní, por lo que mi trabajo era mantener esa línea visual cuando se solicitaba un nuevo componente.</p><p>Esta aplicación web estaba hecha con una base de Opencart, y usó integraciones de Paypal, Braintree y Stripe para los pagos.</p><p>Después de 2 años trabajando en el proyecto, me solicitaron que encuentre una manera de clonar la aplicación, para que nuevos socios puedan tener una versión con su marca propia.<br />Esto lo hice con Grunt y Node: corriendo un comando de Node, el tema por defecto era clonado en un directorio con los nombres y la personalización de estas marcas, usando solo un código fuente para todos.</p>"
      },
      {
        "code": "biggame",
        "title": "Big Game",
        "dates": "2021 - 2022",
        "description": "<p>Este es un clon de la aplicación de ambassadors de Bucked Up. Me solicitaron que tenga exactamente las mismas funciones con colores apenas diferentes.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1TDs-63CcYtUgdVTSLE-XRvnyfN83-qLb/preview' frameborder='0' allow='fullscreen'></iframe></div>"
      },
      {
        "code": "muna",
        "title": "Muna",
        "dates": "2020",
        "description": "<p>Este sitio ecommerce fue hecho con Wordpress, utilicé como base un tema optimizado en velocidad (astra) para aplicar el diseño e integrar varias herramientas de marketing como Facebook shop, un pixel de facebook, google ads y mailchimp.</p><p>Los pagos se procesan con Woocommerce y una pasarela de pagos local. Permite tarjetas de crédito, transferencias bancarias y \"efectivo\" (imprimiendo un ticket de pago). Los envíos son calculados automáticamente usando las APIs de dos empresas de transporte locales.</p><div class='video-container'><iframe src='https://drive.google.com/file/d/1Orzhq9FFopprTkwtze3t3vVce5l2M3bD/preview' frameborder='0' allow='fullscreen'></iframe></div>"
      },
      {
        "code": "agency",
        "title": "Agency Dashboard",
        "dates": "2018 - 2020",
        "description": "<p>Este es un plugin de Wordpress para agencias de marketing/publicidad, que puede ser instalado en sus sitios web y obtener una versión reducida de la plataforma de Stim.</p><p>Fuí el único desarrollador trabajando en el plugin, el frontend fue hecho con Vue, LESS y Grunt, el backend se conecta a la API de Stim u la autentificación está hecha con tokens.</p><div class='video-container portrait'><iframe src='https://drive.google.com/file/d/1yJqnh0bemk08tXA3ke_zSuXH6C-L5AO6/preview' frameborder='0' allow='fullscreen'></iframe></div>"
      }
    ]
  }
}